//  Кнопка еще для вывода доп.карточек в галерее  //
//  Если карточек >3, под ними появляется кнопка «Ещё»   //
//  По нажатию отрисовываются ещё три, а кнопка сдвигается ниже под блок с карточками  //
//  Ширина 1280px — 12 карточек по 3 в ряд. «Ещё» загружает по 3 карточки.  //
//  Ширина 768px — 8 карточек по 2 в ряд. «Ещё» загружает по 2 карточки.  //
//  Ширина от 320px до 480px — 5 карточек по 1 в ряд. «Ещё» загружает по 2 карточки  //

import './More.css';

const More = ( {onLoadMore} ) => {
  return (
    <button className='link movies__button' onClick={onLoadMore}>
      Ещё
    </button>
  );
}

export default More;
